### Task 1: Configure VLANs
#### SW1:
```shell
SW1(config)# vlan 12
SW1(config-vlan)# name Compute
SW1(config-vlan)# exit
SW1(config)# vlan 34
SW1(config-vlan)# name Telephony
SW1(config-vlan)# exit
```
#### SW2:
```shell
SW2(config)# vlan 12
SW2(config-vlan)# name Compute
SW2(config-vlan)# exit
SW2(config)# vlan 34
SW2(config-vlan)# name Telephony
SW2(config-vlan)# exit
```

### Task 2: Configure e0/1 on SW2 to use the existing VLAN named Available
#### SW2:
First, check the VLAN ID for "Available":
```shell
SW2# show vlan brief
```
Assuming the VLAN ID for "Available" is `20` (replace with the actual ID found in the previous command output):
```shell
SW2(config)# interface e0/1
SW2(config-if)# switchport mode access
SW2(config-if)# switchport access vlan 20
SW2(config-if)# exit
```

### Task 3: Configure the connection between the switches using access ports
#### SW1:
```shell
SW1(config)# interface e0/0
SW1(config-if)# switchport mode access
SW1(config-if)# switchport access vlan 12
SW1(config-if)# exit
```
#### SW2:
```shell
SW2(config)# interface e0/0
SW2(config-if)# switchport mode access
SW2(config-if)# switchport access vlan 12
SW2(config-if)# exit
```

### Task 4: Configure e0/1 on SW1 using data and voice VLANs
#### SW1:
```shell
SW1(config)# interface e0/1
SW1(config-if)# switchport mode access
SW1(config-if)# switchport voice vlan 34
SW1(config-if)# switchport access vlan 12
SW1(config-if)# exit
```

### Task 5: Configure e0/1 on SW2 so that the Cisco proprietary neighbor discovery protocol is turned off for the designated interface only
#### SW2:
Enable CDP globally (if not already enabled):
```shell
SW2(config)# cdp run
```
Disable CDP on the specific interface:
```shell
SW2(config)# interface e0/1
SW2(config-if)# no cdp enable
SW2(config-if)# exit
```

These commands will configure the VLANs, set the appropriate VLAN for interfaces, configure access ports, and disable CDP on the specified interface.