
### Task 1: Configure reachability to the switch SW1 LAN subnet in router R2

On **R2**, add the following static route:
```shell
R2(config)# ip route 192.168.0.0 255.255.255.0 10.10.31.1
```

### Task 2: Configure default reachability to the Internet subnet in router R1

On **R1**, add the default route to reach the Internet:
```shell
R1(config)# ip route 0.0.0.0 0.0.0.0 10.10.13.3
```

### Task 3: Configure a single static route in router R2 to reach the Internet subnet considering both redundant links between routers R1 and R2

Assuming both links are up and OSPF is handling load balancing, a static route to the Internet can be configured as follows:
```shell
R2(config)# ip route 172.20.20.128 255.255.255.128 10.10.12.1
```
This configuration assumes that R1 will be the gateway for reaching the 172.20.20.128/25 subnet. This approach leverages the redundancy provided by OSPF.

### Task 4: Configure a static route in router R1 toward the switch SW1 LAN subnet with primary and backup links

On **R1**, add the primary route via `Ethernet0/1` and the floating route via `Ethernet0/2`:
```shell
R1(config)# ip route 192.168.0.0 255.255.255.0 10.10.12.2
R1(config)# ip route 192.168.0.0 255.255.255.0 10.10.12.130 2
```
The second route has an administrative distance of `2`, making it a floating static route that will be used if the primary route fails.
