
### Task 1: Configure R1 and R2 Router IDs using the interface IP addresses from the link that is shared between them.

#### **R1**
```shell
R1(config)# router ospf 1
R1(config-router)# router-id 10.10.12.1
```

#### **R2**
```shell
R2(config)# router ospf 1
R2(config-router)# router-id 10.10.12.2
```

### Task 2: Configure the R2 links with a max value facing R1 and R3. R2 must become the DR. R1 and R3 links facing R2 must remain with the default OSPF configuration for DR election. Verify the configuration after clearing the OSPF process.

#### **R2**
```shell
R2(config)# interface GigabitEthernet0/0
R2(config-if)# ip ospf priority 255
R2(config-if)# exit
R2(config)# interface GigabitEthernet0/1
R2(config-if)# ip ospf priority 255
R2(config-if)# exit
```

After configuring the priority on R2, clear the OSPF process to ensure the new configuration takes effect:
```shell
R2# clear ip ospf process
```

### Task 3: Using a host wildcard mask, configure all three routers to advertise their respective Loopback1 networks.

#### **R1**
```shell
R1(config)# router ospf 1
R1(config-router)# network 10.10.10.1 0.0.0.0 area 0
```

#### **R2**
```shell
R2(config)# router ospf 1
R2(config-router)# network 10.10.10.2 0.0.0.0 area 0
```

#### **R3**
```shell
R3(config)# router ospf 1
R3(config-router)# network 10.10.10.3 0.0.0.0 area 0
```

### Task 4: Configure the link between R1 and R3 to disable their ability to add other OSPF routers.

#### **R1**
```shell
R1(config)# interface GigabitEthernet0/1
R1(config-if)# ip ospf network point-to-point
```

#### **R3**
```shell
R3(config)# interface GigabitEthernet0/1
R3(config-if)# ip ospf network point-to-point
```

### Summary of Configuration Commands

#### **R1**
```shell
configure terminal
router ospf 1
router-id 10.10.12.1
log-adjacency-changes
network 10.10.10.1 0.0.0.0 area 0
exit
interface GigabitEthernet0/1
ip ospf network point-to-point
exit
```

#### **R2**
```shell
configure terminal
router ospf 1
router-id 10.10.12.2
log-adjacency-changes
network 10.10.10.2 0.0.0.0 area 0
exit
interface GigabitEthernet0/0
ip ospf priority 255
exit
interface GigabitEthernet0/1
ip ospf priority 255
exit
clear ip ospf process
```

#### **R3**
```shell
configure terminal
router ospf 1
log-adjacency-changes
network 10.10.10.3 0.0.0.0 area 0
exit
interface GigabitEthernet0/1
ip ospf network point-to-point
exit
```

These configurations ensure that the OSPF adjacencies are established as required, with R2 becoming the DR on its links with R1 and R3, the Loopback1 networks are advertised, and the link between R1 and R3 is set to point-to-point to disable the addition of other OSPF routers.