
### Task 1: Configure the VLAN connecting to the switch port for PC3 with the name "SALES"

#### **SW-2**
```shell
SW-2(config)# vlan 30
SW-2(config-vlan)# name SALES
SW-2(config-vlan)# exit
```

### Task 2: Configure the switch port connecting to Server1

#### **SW-2**
```shell
SW-2(config)# interface Ethernet0/2
SW-2(config-if)# switchport mode access
SW-2(config-if)# switchport access vlan 20
SW-2(config-if)# no shutdown
SW-2(config-if)# exit
```

### Task 3: Configure the switch port connecting to PC3

#### **SW-2**
```shell
SW-2(config)# interface Ethernet0/3
SW-2(config-if)# switchport mode access
SW-2(config-if)# switchport access vlan 30
SW-2(config-if)# no shutdown
SW-2(config-if)# exit
```

### Task 4: Ensure R1 discovers SW-1 via the Cisco proprietary neighbor discovery protocol and all other devices on the network are unable to discover SW-1

#### **SW-1**
```shell
SW-1(config)# cdp run

SW-1(config)# interface Ethernet0/1
SW-1(config-if)# no cdp enable
SW-1(config-if)# no shutdown
SW-1(config-if)# exit

SW-1(config)# interface Ethernet0/2
SW-1(config-if)# no cdp enable
SW-1(config-if)# no shutdown
SW-1(config-if)# exit
```

### Verifying and Saving Configurations
#### **SW-2**
```shell
SW-2# show vlan brief
SW-2# show running-config
SW-2# copy running-config startup-config
```

#### **SW-1**
```shell
SW-1# show cdp neighbors
SW-1# show running-config
SW-1# copy running-config startup-config
```

By following these steps, the configuration tasks should be properly completed as per the requirements.