
### Task 1: Configure SW-1 with VLAN 15 and label it exactly as OPS
```shell
SW1(config)#vlan 15
SW1(config-vlan)#name OPS
SW1(config-vlan)#exit
```

### Task 2: Configure SW-2 with VLAN 66 and label it exactly as ENGINEERING
```shell
SW2(config)#vlan 66
SW2(config-vlan)#name ENGINEERING
SW2(config-vlan)#exit
```

### Task 3: Configure the switch port connecting to PC1 (SW-1)
```shell
SW1(config)#interface e0/1
SW1(config-if)#switchport mode access
SW1(config-if)#switchport access vlan 15
SW1(config-if)#no shutdown
SW1(config-if)#exit
```

### Task 4: Configure the switch port connecting to PC2 (SW-2)
```shell
SW2(config)#interface e0/1
SW2(config-if)#switchport mode access
SW2(config-if)#switchport access vlan 66
SW2(config-if)#no shutdown
SW2(config-if)#exit
```

### Task 5: Configure E0/2 connections on SW-1 and SW-2 for neighbor discovery using LLDP and ensure E0/0 on both switches uses CDP

#### SW-1
```shell
SW1(config)#lldp run
SW1(config)#interface e0/2
SW1(config-if)#no cdp enable
SW1(config-if)#lldp transmit
SW1(config-if)#lldp receive
SW1(config-if)#exit
SW1(config)#interface e0/0
SW1(config-if)#no lldp transmit
SW1(config-if)#no lldp receive
SW1(config-if)#cdp enable
SW1(config-if)#switchport mode trunk
SW1(config-if)#exit
```

#### SW-2
```shell
SW2(config)#lldp run
SW2(config)#interface e0/2
SW2(config-if)#no cdp enable
SW2(config-if)#lldp transmit
SW2(config-if)#lldp receive
SW2(config-if)#exit
SW2(config)#interface e0/0
SW2(config-if)#no lldp transmit
SW2(config-if)#no lldp receive
SW2(config-if)#cdp enable
SW2(config-if)#switchport mode trunk
SW2(config-if)#exit
```
