
### Task 1: Configure SW-1 and SW-2 switch ports e0/0 and e0/1 for 802.1q trunking allowing all VLANs

**SW-1:**
```shell
SW-1(config)#interface range gigabitEthernet 0/0-1
SW-1(config-if-range)#switchport trunk encapsulation dot1q
SW-1(config-if-range)#switchport mode trunk
SW-1(config-if-range)#switchport trunk allowed vlan all
SW-1(config-if-range)#exit
```

**SW-2:**
```shell
SW-2(config)#interface range gigabitEthernet 0/0-1
SW-2(config-if-range)#switchport trunk encapsulation dot1q
SW-2(config-if-range)#switchport mode trunk
SW-2(config-if-range)#switchport trunk allowed vlan all
SW-2(config-if-range)#exit
```

### Task 2: Configure the inter-switch links on SW-1 e0/2, SW-2 e0/2, and SW-3 e0/0 and e0/1 to use native VLAN 35

**SW-1:**
```shell
SW-1(config)#interface gigabitEthernet 0/2
SW-1(config-if)#switchport trunk encapsulation dot1q
SW-1(config-if)#switchport mode trunk
SW-1(config-if)#switchport trunk native vlan 35
SW-1(config-if)#exit
```

**SW-2:**
```shell
SW-2(config)#interface gigabitEthernet 0/2
SW-2(config-if)#switchport trunk encapsulation dot1q
SW-2(config-if)#switchport mode trunk
SW-2(config-if)#switchport trunk native vlan 35
SW-2(config-if)#exit
```

**SW-3:**
```shell
SW-3(config)#interface range gigabitEthernet 0/0-1
SW-3(config-if-range)#switchport trunk encapsulation dot1q
SW-3(config-if-range)#switchport mode trunk
SW-3(config-if-range)#switchport trunk native vlan 35
SW-3(config-if-range)#exit
```

### Task 3: Configure SW-1 and SW-2 switch ports e0/0 and e0/1 for link aggregation (LACP)
**SW-1 should immediately negotiate LACP and SW-2 must only respond to LACP requests**

**SW-1:**
```shell
SW-1(config)#interface range gigabitEthernet 0/0-1
SW-1(config-if-range)#channel-group 12 mode active
SW-1(config-if-range)#exit
```

**SW-2:**
```shell
SW-2(config)#interface range gigabitEthernet 0/0-1
SW-2(config-if-range)#channel-group 12 mode passive
SW-2(config-if-range)#exit
```

