
### Task 1: Configure SW-2 and SW-3 ports E0/0 to use the industry standard encapsulation method for trunking and only tag VLAN 10

The correct syntax to configure a trunk port to tag only VLAN 10:

**SW-2:**
```shell
SW-2(config)#interface gigabitEthernet 0/0
SW-2(config-if)#switchport trunk encapsulation dot1q
SW-2(config-if)#switchport mode trunk
SW-2(config-if)#switchport trunk allowed vlan 10
```

**SW-3:**
```shell
SW-3(config)#interface gigabitEthernet 0/0
SW-3(config-if)#switchport trunk encapsulation dot1q
SW-3(config-if)#switchport mode trunk
SW-3(config-if)#switchport trunk allowed vlan 10
```

### Task 2: Configure SW-2 and SW-3 ports E0/0 to send and receive untagged traffic over VLAN 11

The correct syntax to configure a native VLAN for untagged traffic:

**SW-2:**
```shell
SW-2(config)#interface gigabitEthernet 0/0
SW-2(config-if)#switchport trunk native vlan 11
```

**SW-3:**
```shell
SW-3(config)#interface gigabitEthernet 0/0
SW-3(config-if)#switchport trunk native vlan 11
```

### Task 3: Configure SW-2 and SW-3 ports E0/2 and E0/3 to use the industry standard encapsulation method for trunking and tag all VLANs

The correct syntax to configure trunk ports to tag all VLANs:

**SW-2:**
```shell
SW-2(config)#interface range gigabitEthernet 0/2-3
SW-2(config-if-range)#switchport trunk encapsulation dot1q
SW-2(config-if-range)#switchport mode trunk
```

**SW-3:**
```shell
SW-3(config)#interface range gigabitEthernet 0/2-3
SW-3(config-if-range)#switchport trunk encapsulation dot1q
SW-3(config-if-range)#switchport mode trunk
```

### Task 4: Configure SW-2 and SW-3 ports E0/2 and E0/3 for link aggregation using the industry standard protocol with specific negotiation requirements

**SW-2 ports must not initiate the negotiation for the aggregation protocol (passive mode)**
**SW-3 ports must immediately negotiate the aggregation protocol (active mode)**

**SW-2:**
```shell
SW-2(config)#interface range gigabitEthernet 0/2-3
SW-2(config-if-range)#channel-group 23 mode passive
```

**SW-3:**
```shell
SW-3(config)#interface range gigabitEthernet 0/2-3
SW-3(config-if-range)#channel-group 23 mode active
```
