
### Task 1: Configure SW-1 port E0/0 to permit only VLANS 5 and 6
The commands for this are correct:
```shell
SW-1(config)#interface gigabitEthernet 0/0
SW-1(config-if)#switchport mode trunk
SW-1(config-if)#switchport trunk allowed vlan 5,6
```

### Task 2: Configure both SW-1 and SW-2's E0/1 ports to send and receive untagged traffic over VLAN 77
The commands for this are correct:
```shell
SW-1(config)#interface gigabitEthernet 0/1
SW-1(config-if)#switchport mode trunk
SW-1(config-if)#switchport trunk native vlan 77

SW-2(config)#interface gigabitEthernet 0/1
SW-2(config-if)#switchport mode trunk
SW-2(config-if)#switchport trunk native vlan 77
```

### Task 3: Configure SW-2 E0/2 port to permit only VLAN 6
The commands for this are correct:
```shell
SW-2(config)#interface gigabitEthernet 0/2
SW-2(config-if)#switchport mode trunk
SW-2(config-if)#switchport trunk allowed vlan 6
```

### Task 4: Configure both SW-3 and SW-4 ports E0/0 and E0/1 for link aggregation using the industry standard protocol with the following requirements:
- SW-3 ports must immediately negotiate the aggregation protocol.
- SW-4 ports must not initiate the negotiation for the aggregation protocol.
- Use the designated number assignment (34).

The commands for this are correct:
```shell
SW-3(config)#interface range gigabitEthernet 0/0-1
SW-3(config-if-range)#channel-group 34 mode active

SW-4(config)#interface range gigabitEthernet 0/0-1
SW-4(config-if-range)#channel-group 34 mode passive
```
