![alt text](https://img.examtopics.com/200-301/image373.png)

R1 has been pre-configured with all the necessary commands. All physical cabling is in place and verified. Connectivity to the end devices must be configured.

1. Configure SW-1 switch port 0/1 to carry traffic for the Cisco IP phone and PC
2. Configure SW-2 E0/1 to carry traffic for PC2
3. Configure VLAN 10 with the name “Engineering” on SW-1
4. Configure the link between SW-1 and SW-2 to use the vendor neutral neighbor discovery protocol
5. Configure the link on SW-1 to R1 so that it does not allow the Cisco neighbor discovery protocol to pass

### Task 1: Configure SW-1 switch port 0/1 to carry traffic for the Cisco IP phone and PC

On SW-1, configure port E0/1:

```shell
SW-1(config)# interface ethernet0/1
SW-1(config-if)# switchport mode access
SW-1(config-if)# switchport voice vlan 11
SW-1(config-if)# switchport access vlan 10
SW-1(config-if)# end
SW-1(config)# wr
```

### Task 2: Configure SW-2 E0/1 to carry traffic for PC2

On SW-2, configure port E0/1:

```shell
SW-2(config)# interface ethernet0/1
SW-2(config-if)# switchport mode access
SW-2(config-if)# switchport access vlan 30
SW-2(config-if)# end
SW-2(config)# wr
```

### Task 3: Configure VLAN 10 with the name “Engineering” on SW-1

On SW-1, create and name VLAN 10:

```shell
SW-1(config)# vlan 10
SW-1(config-vlan)# name Engineering
SW-1(config-vlan)# end
SW-1(config)# wr
```

### Task 4: Configure the link between SW-1 and SW-2 to use the vendor-neutral neighbor discovery protocol (LLDP)

On SW-1 and SW-2, enable LLDP and configure interfaces:

#### SW-1:
```shell
SW-1(config)# lldp run
SW-1(config)# interface ethernet0/0
SW-1(config-if)# lldp transmit
SW-1(config-if)# lldp receive
SW-1(config-if)# end
SW-1(config)# wr
```

#### SW-2:
```shell
SW-2(config)# lldp run
SW-2(config)# interface ethernet0/0
SW-2(config-if)# lldp transmit
SW-2(config-if)# lldp receive
SW-2(config-if)# end
SW-2(config)# wr
```

### Task 5: Configure the link on SW-1 to R1 so that it does not allow the Cisco neighbor discovery protocol (CDP) to pass

On SW-1, disable CDP on the interface connected to R1:

```shell
SW-1(config)# interface ethernet0/2
SW-1(config-if)# no cdp enable
SW-1(config-if)# end
SW-1(config)# wr
```
